CSI API ETABS v1
cDesignConcrete.SetCode Method
 Sets the concrete design code.
 Namespace: ETABSv1
 Assembly: ETABSv1 (in ETABSv1.dll) Version: 1.0.0.0 (2.6.0.0)
Syntax
int SetCode(
	string CodeName
)
Function SetCode (
	CodeName As String
) As Integer
Dim instance As cDesignConcrete
Dim CodeName As String
Dim returnValue As Integer
returnValue = instance.SetCode(CodeName)
int SetCode(
	String^ CodeName
)
abstract SetCode :
        CodeName : string -> int
Parameters
CodeName
Type: System.String
 This is one of the following concrete design code names.
ACI 318-14
ACI 318-11
ACI 318-08
AS 3600-2018
AS 3600-09
BS 8110-97
Chinese 2010
CSA A23.3-14
CSA A23.3-04
Eurocode 2-2004
Hong Kong CP 2013
IS 456:2000
Italian NTC 2008
KBC 2016
KBC 2009
Mexican RCDF 2017
Mexican RCDF 2004
NZS 3101:2006
Singapore CP 65:99
SP 63.13330.2012
TS 500-2000(R2018)
TS 500-2000
TCVN 5574:2012
Return Value
Type: Int32
 Returns zero if the code is successfully set; otherwise it returns a nonzero value.
Remarks
Examples
Public Sub Example()
   Dim SapModel As cSapModel
   Dim EtabsObject As cOAPI
   Dim ret As Integer = -1
'create ETABS object
   Dim myHelper as cHelper = New Helper
   EtabsObject = myHelper.CreateObjectProgID("CSI.ETABS.API.ETABSObject")
'start ETABS application
  ret = EtabsObject.ApplicationStart()
'create SapModel object
   SapModel = EtabsObject.SapModel
'initialize model
   ret = SapModel.InitializeNewModel()
'create steel deck template model
   ret = SapModel.File.NewSteelDeck(4, 12, 12, 4, 4, 24, 24)
'create new concrete frame section property
   ret = SapModel.PropFrame.SetRectangle("R1", "4000Psi", 20, 12)
'set frame section property
   ret = SapModel.FrameObj.SetSection("8", "R1")
'set concrete design code
   ret = SapModel.DesignConcrete.SetCode("ACI 318-08/IBC 2009")
'close ETABS
   EtabsObject.ApplicationExit(False)
'clean up variables
   SapModel = Nothing
   EtabsObject = Nothing
End Sub
See Also
Reference
cDesignConcrete Interface
ETABSv1 Namespace